In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('E:\\Machine_Learning\\student.csv')
df

,Student ID,Class,Study hrs,Sleeping h,Social media,Mobile,Percentage
0,1001,10,2,5,1,1,50
1,1002,10,6,6,3,0,80
2,1003,10,3,7,4,2,70
3,1004,11,4,8,5,3,85
4,1005,11,5,9,6,4,70
5,1006,11,6,10,7,6,60
6,1007,12,9,11,8,5,90
7,1008,12,10,12,9,7,95
8,1009,12,12,8,10,8,90
9,1010,12,1,12,11,9,80

In [5]:
df.loc[0]

Student ID      1001
Class             10
Study hrs          2
Sleeping h         5
Social media       1
  Mobile           1
Percentage        50
Name: 0, dtype: int64

In [6]:
df.loc[4]

Student ID      1005
Class             11
Study hrs          5
Sleeping h         9
Social media       6
  Mobile           4
Percentage        70
Name: 4, dtype: int64

In [9]:
df.loc[[0,1]]

,Student ID,Class,Study hrs,Sleeping h,Social media,Mobile,Percentage
0,1001,10,2,5,1,1,50
1,1002,10,6,6,3,0,80

In [10]:
df.loc[1,'Class']

10

In [11]:
df.loc[0:3,'Class']

0    10
1    10
2    10
3    11
Name: Class, dtype: int64

In [17]:
df.loc[df['Class']<11]

,Student ID,Class,Study hrs,Sleeping h,Social media,Mobile,Percentage
0,1001,10,2,5,1,1,50
1,1002,10,6,6,3,0,80
2,1003,10,3,7,4,2,70

In [18]:
df.loc[df['Class']<11,['Percentage']]

   Percentage
0          50
1          80
2          70

In [19]:
df.iloc[0]

Student ID      1001
Class             10
Study hrs          2
Sleeping h         5
Social media       1
  Mobile           1
Percentage        50
Name: 0, dtype: int64

In [20]:
df.iloc[:,0]

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64

In [21]:
df.iloc[[0,1]]

,Student ID,Class,Study hrs,Sleeping h,Social media,Mobile,Percentage
0,1001,10,2,5,1,1,50
1,1002,10,6,6,3,0,80